app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 2  [["text", "sdfgsdf"], ["title", "testffff"], ["updated_at", "2014-06-10 20:52:22.957458"]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)