app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 2], ["body", "asdf"], ["commenter", "ad"], ["created_at", "2014-06-10 20:52:11.651813"], ["updated_at", "2014-06-10 20:52:11.651813"]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article.comments.create(comment_params)